#include <stdio.h>
int main()
{
	double x1, y1, x2, y2, x3, y3, x4, y4;
	while (scanf("%lf%lf%lf%lf%lf%lf%lf%lf",  &x1, &y1, &x2, &y2, &x3, &y3, &x4, &y4) != EOF){
		double a[2][2], b[2][2];
		if (x1 > x2){
			a[0][0] = x2;
			a[1][0] = x2;
		}else{
			a[0][0] = x1;
			a[1][0] = x1;
		}
		if (y1 > y2){
			a[0][1] = x2;
			a[1][1] = x2;
		}else{
			a[0][1] = x1;
			a[1][1] = x1;
		}
		if (x3 > x4){
			b[0][0] = x2;
			b[1][0] = x2;
		}else{
			b[0][0] = x1;
			b[1][0] = x1;
		}
		if (y3 > y4){
			b[0][1] = x2;
			b[1][1] = x2;
		}else{
			a[0][1] = x1;
			a[1][1] = x1;
		}
		double S = 0;
		if (a[0][0] > b[1][0] || a[0][1] > b[1][1] || a[1][0] < b[0][0] || a[1][1] < b[0][1]){
			printf("%.2lf", S);//所有空的情况
		}else if (a[0][0] < b[0][0] && a[0][1] < b[0][1] && a[1][0] > b[1][0] && a[1][1] > b[1][1]){
			S = (a[1][0] - a[0][0]) * (a[1][1] - a[0][1]);
			printf("%.2lf", S);//包含
		}else if (a[0][0] > b[0][0] && a[0][1] > b[0][1] && a[1][0] < b[1][0] && a[1][1] < b[1][1]){
			S = (b[1][0] - b[0][0]) * (b[1][1] - b[0][1]);
			printf("%.2lf", S);//包含
/*分上下左右讨论*/		
		}else if (a[0][0] < b[0][0] && a[0][1] < b[0][1] &&){

		}
	}
	return 0;
}
