/*************************************************************************
    > File Name: src/2021.c
    > Author: JS
    > Created Time: 2016年03月14日 星期一 22时18分11秒
 ************************************************************************/
/*100中包括50,50里包括10,10里包括5 
 * 然而5里不包括2 
 * 取余时要小心 */
#include <stdio.h>
int main()
{
	int n;
	while (scanf("%d", &n) != EOF && n != 0){
		int a[100];
		for (int i = 0; i < n; i++){
			scanf("%d", &a[i]);
		}
		int sum = 0;
		for (int i = 0; i < n; i++){
			//除100，然后，取余,除50。。。。
			int m1, m2, m3, m4, m5, m6;
			m1 = a[i] / 100;
			m2 = (a[i] % 100) / 50;
			m3 = (a[i] % 50) / 10;
			m4 = (a[i] % 10) / 5;
			m5 = (a[i] % 5) / 2;
			m6 = a[i] % 5 % 2;
			sum = sum + m1 + m2 + m3 + m4 + m5 + m6;
		}
		printf("%d\n", sum);
	}
	return 0;
}
