/*************************************************************************
    > File Name: src/2037.c
    > Author: Js
    > Created Time: 2016年03月22日 星期二 20时58分49秒
 ************************************************************************/

#include<stdio.h>
int main()
{
	int n;
	while(scanf ("%d", &n) != EOF && n){
		int a[100][2], b[100][100];
		//把ｂ赋值为-1便于判断
		for (int i = 0; i < 100; i++){
			for (int j = 0; j < 100; j++){
				b[i][j] = -1;
			}
		}
		//输入数据
		for (int i = 0; i < n; i++){
			scanf ("%d%d", &a[i][0], &a[i][1]);
		}
		//把输入数据按起终止时间放入ｂ中
		for (int i = 0; i < n; i++){
			b[a[i][1]][0] = a[i][1];
			b[a[i][1]][i] = a[i][1];
		}
		//给找到最大的放在ｂ[i][1]处
		for (int i = 0; i < 100; i++){
			for(int j = 2; j < n; j++){
				if (b[i][1] < b[i][j]){
					b[i][1] = b[i][j]; 
				}
			}
		}
		int count = 0;
		//从ｂ[0][0]开始找ｂ[n][0]直到不为-1
		//count++
		int j = b[0][0];
		for (int i = 0; i < 24; i++){
			if (b[b[i][1]][1] != -1 && b[b[i][1]][0] != -1 && b[b[i][1]][1] >= b[j][0]){
				j = b[i][0];
				count++;
			}
		}
		printf ("%d\n", count);
	}
	return 0;
}
